RestSoapSignEncrypt/WcfClient/WcfClient/Connected Services/RestSoapSignEncrypt/RestSoapSignEncrypt.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:tns="http://tempuri.org/" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema" name="RestSoapSignEncrypt" targetNamespace="http://tempuri.org/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <wsp:Policy wsu:Id="RestSoapSignEncryptBinding_IRestSoapSignEncrypt_policy">
    <wsp:ExactlyOne>
      <wsp:All>
        <sp:AsymmetricBinding xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy">
          <wsp:Policy>
            <sp:InitiatorToken>
              <wsp:Policy>
                <sp:X509Token sp:IncludeToken="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy/IncludeToken/AlwaysToRecipient">
                  <wsp:Policy>
                    <sp:WssX509V3Token10 />
                  </wsp:Policy>
                </sp:X509Token>
              </wsp:Policy>
            </sp:InitiatorToken>
            <sp:RecipientToken>
              <wsp:Policy>
                <sp:X509Token sp:IncludeToken="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy/IncludeToken/Never">
                  <wsp:Policy>
                    <sp:WssX509V3Token10 />
                  </wsp:Policy>
                </sp:X509Token>
              </wsp:Policy>
            </sp:RecipientToken>
            <sp:AlgorithmSuite>
              <wsp:Policy>
                <sp:Basic256 />
              </wsp:Policy>
            </sp:AlgorithmSuite>
            <sp:Layout>
              <wsp:Policy>
                <sp:Lax />
              </wsp:Policy>
            </sp:Layout>
            <sp:IncludeTimestamp />
            <sp:EncryptSignature />
            <sp:OnlySignEntireHeadersAndBody />
          </wsp:Policy>
        </sp:AsymmetricBinding>
        <sp:Wss10 xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy">
          <wsp:Policy>
            <sp:MustSupportRefKeyIdentifier />
            <sp:MustSupportRefIssuerSerial />
          </wsp:Policy>
        </sp:Wss10>
      </wsp:All>
    </wsp:ExactlyOne>
  </wsp:Policy>
  <wsp:Policy wsu:Id="RestSoapSignEncryptBinding_IRestSoapSignEncrypt_Celsius2Fahrenheit_Input_policy">
    <wsp:ExactlyOne>
      <wsp:All>
        <sp:SignedParts xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy">
          <sp:Body />
        </sp:SignedParts>
        <sp:EncryptedParts xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy">
          <sp:Body />
        </sp:EncryptedParts>
      </wsp:All>
    </wsp:ExactlyOne>
  </wsp:Policy>
  <wsp:Policy wsu:Id="RestSoapSignEncryptBinding_IRestSoapSignEncrypt_Celsius2Fahrenheit_output_policy">
    <wsp:ExactlyOne>
      <wsp:All>
        <sp:SignedParts xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy">
          <sp:Body />
        </sp:SignedParts>
        <sp:EncryptedParts xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy">
          <sp:Body />
        </sp:EncryptedParts>
      </wsp:All>
    </wsp:ExactlyOne>
  </wsp:Policy>
  <wsp:Policy wsu:Id="RestSoapSignEncryptBinding_IRestSoapSignEncrypt_Celsius2Fahrenheit_ConversionFault_Fault">
    <wsp:ExactlyOne>
      <wsp:All>
        <sp:SignedParts xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy">
          <sp:Body />
        </sp:SignedParts>
        <sp:EncryptedParts xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy">
          <sp:Body />
        </sp:EncryptedParts>
      </wsp:All>
    </wsp:ExactlyOne>
  </wsp:Policy>
  <wsp:Policy wsu:Id="RestSoapSignEncryptBinding_IRestSoapSignEncrypt_Fahrenheit2Celsius_Input_policy">
    <wsp:ExactlyOne>
      <wsp:All>
        <sp:SignedParts xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy">
          <sp:Body />
        </sp:SignedParts>
        <sp:EncryptedParts xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy">
          <sp:Body />
        </sp:EncryptedParts>
      </wsp:All>
    </wsp:ExactlyOne>
  </wsp:Policy>
  <wsp:Policy wsu:Id="RestSoapSignEncryptBinding_IRestSoapSignEncrypt_Fahrenheit2Celsius_output_policy">
    <wsp:ExactlyOne>
      <wsp:All>
        <sp:SignedParts xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy">
          <sp:Body />
        </sp:SignedParts>
        <sp:EncryptedParts xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy">
          <sp:Body />
        </sp:EncryptedParts>
      </wsp:All>
    </wsp:ExactlyOne>
  </wsp:Policy>
  <wsp:Policy wsu:Id="RestSoapSignEncryptBinding_IRestSoapSignEncrypt_Fahrenheit2Celsius_ConversionFault_Fault">
    <wsp:ExactlyOne>
      <wsp:All>
        <sp:SignedParts xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy">
          <sp:Body />
        </sp:SignedParts>
        <sp:EncryptedParts xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy">
          <sp:Body />
        </sp:EncryptedParts>
      </wsp:All>
    </wsp:ExactlyOne>
  </wsp:Policy>
  <wsdl:types>
    <xsd:schema targetNamespace="http://tempuri.org/Imports">
      <xsd:import schemaLocation="http://localhost:51899/RestSoapSignEncrypt.svc?xsd=xsd0" namespace="http://tempuri.org/" />
      <xsd:import schemaLocation="http://localhost:51899/RestSoapSignEncrypt.svc?xsd=xsd1" namespace="http://schemas.microsoft.com/2003/10/Serialization/" />
      <xsd:import schemaLocation="http://localhost:51899/RestSoapSignEncrypt.svc?xsd=xsd2" namespace="http://schemas.datacontract.org/2004/07/WcfService" />
    </xsd:schema>
  </wsdl:types>
  <wsdl:message name="IRestSoapSignEncrypt_Celsius2Fahrenheit_InputMessage">
    <wsdl:part name="parameters" element="tns:Celsius2Fahrenheit" />
  </wsdl:message>
  <wsdl:message name="IRestSoapSignEncrypt_Celsius2Fahrenheit_OutputMessage">
    <wsdl:part name="parameters" element="tns:Celsius2FahrenheitResponse" />
  </wsdl:message>
  <wsdl:message name="IRestSoapSignEncrypt_Celsius2Fahrenheit_ConversionFault_FaultMessage">
    <wsdl:part name="detail" element="tns:ConversionFault" />
  </wsdl:message>
  <wsdl:message name="IRestSoapSignEncrypt_Fahrenheit2Celsius_InputMessage">
    <wsdl:part name="parameters" element="tns:Fahrenheit2Celsius" />
  </wsdl:message>
  <wsdl:message name="IRestSoapSignEncrypt_Fahrenheit2Celsius_OutputMessage">
    <wsdl:part name="parameters" element="tns:Fahrenheit2CelsiusResponse" />
  </wsdl:message>
  <wsdl:message name="IRestSoapSignEncrypt_Fahrenheit2Celsius_ConversionFault_FaultMessage">
    <wsdl:part name="detail" element="tns:ConversionFault" />
  </wsdl:message>
  <wsdl:portType name="IRestSoapSignEncrypt">
    <wsdl:operation name="Celsius2Fahrenheit">
      <wsdl:input wsaw:Action="http://tempuri.org/IRestSoapSignEncrypt/Celsius2Fahrenheit" message="tns:IRestSoapSignEncrypt_Celsius2Fahrenheit_InputMessage" />
      <wsdl:output wsaw:Action="http://tempuri.org/IRestSoapSignEncrypt/Celsius2FahrenheitResponse" message="tns:IRestSoapSignEncrypt_Celsius2Fahrenheit_OutputMessage" />
      <wsdl:fault wsaw:Action="http://tempuri.org/IRestSoapSignEncrypt/Celsius2FahrenheitConversionFault" name="ConversionFault" message="tns:IRestSoapSignEncrypt_Celsius2Fahrenheit_ConversionFault_FaultMessage" />
    </wsdl:operation>
    <wsdl:operation name="Fahrenheit2Celsius">
      <wsdl:input wsaw:Action="http://tempuri.org/IRestSoapSignEncrypt/Fahrenheit2Celsius" message="tns:IRestSoapSignEncrypt_Fahrenheit2Celsius_InputMessage" />
      <wsdl:output wsaw:Action="http://tempuri.org/IRestSoapSignEncrypt/Fahrenheit2CelsiusResponse" message="tns:IRestSoapSignEncrypt_Fahrenheit2Celsius_OutputMessage" />
      <wsdl:fault wsaw:Action="http://tempuri.org/IRestSoapSignEncrypt/Fahrenheit2CelsiusConversionFault" name="ConversionFault" message="tns:IRestSoapSignEncrypt_Fahrenheit2Celsius_ConversionFault_FaultMessage" />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="RestSoapSignEncryptBinding_IRestSoapSignEncrypt" type="tns:IRestSoapSignEncrypt">
    <wsp:PolicyReference URI="#RestSoapSignEncryptBinding_IRestSoapSignEncrypt_policy" />
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <wsdl:operation name="Celsius2Fahrenheit">
      <soap:operation soapAction="http://tempuri.org/IRestSoapSignEncrypt/Celsius2Fahrenheit" style="document" />
      <wsdl:input>
        <wsp:PolicyReference URI="#RestSoapSignEncryptBinding_IRestSoapSignEncrypt_Celsius2Fahrenheit_Input_policy" />
        <soap:body use="literal" />
      </wsdl:input>
      <wsdl:output>
        <wsp:PolicyReference URI="#RestSoapSignEncryptBinding_IRestSoapSignEncrypt_Celsius2Fahrenheit_output_policy" />
        <soap:body use="literal" />
      </wsdl:output>
      <wsdl:fault name="ConversionFault">
        <wsp:PolicyReference URI="#RestSoapSignEncryptBinding_IRestSoapSignEncrypt_Celsius2Fahrenheit_ConversionFault_Fault" />
        <soap:fault use="literal" name="ConversionFault" namespace="" />
      </wsdl:fault>
    </wsdl:operation>
    <wsdl:operation name="Fahrenheit2Celsius">
      <soap:operation soapAction="http://tempuri.org/IRestSoapSignEncrypt/Fahrenheit2Celsius" style="document" />
      <wsdl:input>
        <wsp:PolicyReference URI="#RestSoapSignEncryptBinding_IRestSoapSignEncrypt_Fahrenheit2Celsius_Input_policy" />
        <soap:body use="literal" />
      </wsdl:input>
      <wsdl:output>
        <wsp:PolicyReference URI="#RestSoapSignEncryptBinding_IRestSoapSignEncrypt_Fahrenheit2Celsius_output_policy" />
        <soap:body use="literal" />
      </wsdl:output>
      <wsdl:fault name="ConversionFault">
        <wsp:PolicyReference URI="#RestSoapSignEncryptBinding_IRestSoapSignEncrypt_Fahrenheit2Celsius_ConversionFault_Fault" />
        <soap:fault use="literal" name="ConversionFault" namespace="" />
      </wsdl:fault>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="RestSoapSignEncrypt">
    <wsdl:port name="RestSoapSignEncryptBinding_IRestSoapSignEncrypt" binding="tns:RestSoapSignEncryptBinding_IRestSoapSignEncrypt">
      <soap:address location="http://localhost:51899/RestSoapSignEncrypt.svc" />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>