RestClientHttpRio/WcfClient/Soap/request-sign.xml

<?xml version='1.0' encoding='UTF-8'?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><s:Header><VsDebuggerCausalityData xmlns="http://schemas.microsoft.com/vstudio/diagnostics/servicemodelsink">uIDPo7gvs7csjyJNmatSFRL2CZcAAAAAvSss7ONlgEeRlw3JGsOHNWjs/QpRhmxPkqhEMkhPv/UACQAA</VsDebuggerCausalityData><o:Security s:mustUnderstand="1" xmlns:o="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><u:Timestamp u:Id="uuid-4b27e0fe-263b-4a1e-af14-60fc7c93c75a-2"><u:Created>2020-01-22T15:43:42.238Z</u:Created><u:Expires>2020-01-22T15:48:42.238Z</u:Expires></u:Timestamp><o:BinarySecurityToken u:Id="uuid-c1afd02c-c083-429b-a257-90cfc18032d1-5" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">MIICvjCCAiegAwIBAgIBAzANBgkqhkiG9w0BAQUFADCBijEZMBcGA1UEAxMQQ2xldmVyVGVzdGVyUm9vdDEOMAwGA1UECxMFRGVtb3MxGTAXBgNVBAoTEENsZXZlckNvbXBvbmVudHMxCzAJBgNVBAcTAkNBMQswCQYDVQQGEwJVUzEoMCYGCSqGSIb3DQEJARYZQ2xldmVyVGVzdGVyQGNvbXBhbnkubWFpbDAeFw0yMDAxMTUyMTAwMDBaFw0zMDAxMTQyMTAwMDBaMIGHMRswGQYDVQQDExJDbGV2ZXJUZXN0ZXJDbGllbnQxDjAMBgNVBAsTBURlbW9zMRQwEgYDVQQKEwtZb3VyQ29tcGFueTELMAkGA1UEBxMCQ0ExCzAJBgNVBAYTAlVTMSgwJgYJKoZIhvcNAQkBFhlDbGV2ZXJUZXN0ZXJAY29tcGFueS5tYWlsMIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQCyHWVCvdvuYfc5+Iv2LSmcmZlphhubDIltnPbVCG77DxMcrE0ukVN+osjFVTox+kIEFRFqZGECc+HvrRDOuW/SXn3GFNhmkmsS8uep6qL9Qls5hJsHMRyar8D2ihfCPRs6Y9ExPKSbn0+C2CGWbLpn6bDNf+81KSCH1Dm/GEkJoQIDAQABozUwMzAxBgNVHSUEKjAoBggrBgEFBQcDAQYIKwYBBQUHAwIGCCsGAQUFBwMDBggrBgEFBQcDBDANBgkqhkiG9w0BAQUFAAOBgQCanMnnIZOC0abuawsTvle5W8tIVfq7tDGD4hcVhrziI5A61Z61assjmTGiX5rwGeKqCAZXgWYw3PGD0RsDmNxT5R9Aey4WEPwBS3xSplka57Qje+5M+J7gLgj3l5fbnViPBBGDaNF4LAwudFctsYwjiyUqdYZBO5dnRFhlYtnSFw==</o:BinarySecurityToken><Signature xmlns="http://www.w3.org/2000/09/xmldsig#"><SignedInfo><CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><Reference URI="#_1"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><DigestValue>kSGnssbj3OXJ6S3EcE0rqPM//uk=</DigestValue></Reference><Reference URI="#uuid-4b27e0fe-263b-4a1e-af14-60fc7c93c75a-2"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><DigestValue>JS0Tf6qgGcdbSgEZP6cM6mx8cYQ=</DigestValue></Reference></SignedInfo><SignatureValue>kLxMwsuebi4jcgQgWYCz3r4VNx6bTLFnkufjE+dJz5RSeE7ej6J3H9tkTU0ggRDppmUw1ZLC6WBAzz3UuYUhZkV2MnmmwIji3AAg5MnhTafqoqUeOJVbFFiywkfJevP7/38fb+vk+5KFPsQHAZrUZ2bYPat5qmr3PTHlKn1tY/o=</SignatureValue><KeyInfo><o:SecurityTokenReference><o:Reference ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" URI="#uuid-c1afd02c-c083-429b-a257-90cfc18032d1-5"/></o:SecurityTokenReference></KeyInfo></Signature></o:Security></s:Header><s:Body u:Id="_1"><Celsius2Fahrenheit xmlns="http://tempuri.org/"><temperature xmlns:a="http://schemas.datacontract.org/2004/07/WcfService" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:Units>C</a:Units><a:Value>0</a:Value></temperature></Celsius2Fahrenheit></s:Body></s:Envelope>